---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSize.Dispose
source: html/d88c54cc-002d-45d9-113b-8c34b645a734.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSize.Dispose Method

Releases all resources used by the ConduitSize

## Syntax (C#)
```csharp
public void Dispose()
```